[
  {
    "id": 0,
    "title": "Games Showcase App",
    "description": "This is a web application developed to display video games from all major platforms. By integrating the rawg.io API, the app allows users to search and filter games by platform, genre, name, etc. It features a PLP for browsing games and a PDP that provides description, trailers, screenshots, metacritic scores and more.\n\n This project demonstrates my skills in responsive design, API integration, and creating intuitive user interfaces. You can view a live demo of the app and explore the source code on GitHub.",
    "screenshots": [
      "/images/screenshots/games-showcase-1.png",
      "/images/screenshots/games-showcase-2.png",
      "/images/screenshots/games-showcase-3.png"
    ],
    "links": {
      "demo": "https://videogames-showcase-app.vercel.app/",
      "github": "https://github.com/AGasco/videogames-showcase-app"
    },
    "backgroundColor": "#524770",
    "objectPosition": "0%"
  },
  {
    "id": 1,
    "title": "Dashboard & Graphs",
    "description": "This project is a web application built with React, Next.js, TypeScript, and Tailwind CSS. It demonstrates key functionalities including secure authentication, dynamic dashboard generation, efficient data handling, and performance optimizations. The application is designed with scalability and maintainability in mind, incorporating best practices in modern web development.\n\n This project demonstrates my expertise in building complex, high-performance views, emphasizing clean code and responsiveness. You can view a live demo of the app and explore the source code on GitHub.",
    "screenshots": [
      "/images/screenshots/dashboard-graphs-1.png",
      "/images/screenshots/dashboard-graphs-2.png",
      "/images/screenshots/dashboard-graphs-3.png"
    ],
    "links": {
      "demo": "https://dashboard-graphs-afg.vercel.app/",
      "github": "https://github.com/AGasco/dashboard-graphs"
    },
    "backgroundColor": "#704747",
    "objectPosition": "center"
  },
  {
    "id": 2,
    "title": "Virtual Garden CRUD",
    "description": "**NOTE**: This is currently in development. The Virtual Garden CRUD Application is a robust web application designed to demonstrate comprehensive frontend development skills in interacting with backend services. Built with React, the app allows users to create, view, update, plant and delete plants seamlessly. By integrating a custom RESTful API, the application ensures real-time data management and persistence. Key features include responsive design, intuitive user interfaces, form validation, error handling, and smooth navigation across different views.\n\nThis project highlights proficiency in API development & integration, state management, and building user-centric applications. You can view a live demo of the Virtual Garden and explore the source code on GitHub.",
    "screenshots": [],
    "links": null,
    "backgroundColor": "#706047",
    "objectPosition": "center"
  }
]
