[
  {
    "id": "01",
    "name": "The OG Triad",
    "logo": "/images/logos/tech/triad-logo.png",
    "link": "https://developer.mozilla.org/",
    "title": "HTML/CSS/JS Title",
    "description": "Mastery of HTML, CSS, and JavaScript forms the foundation of my frontend development skills. I craft semantic, responsive, and interactive web interfaces that provide seamless user experiences."
  },
  {
    "id": "02",
    "name": "The DOM Whisperer",
    "logo": "/images/logos/tech/react-logo.svg",
    "link": "https://react.dev/",
    "title": "React Title",
    "description": "Proficient in React, I build dynamic and scalable user interfaces using component-based architecture. Leveraging React's powerful features, I ensure maintainable and efficient frontend applications."
  },
  {
    "id": "03",
    "name": "The Type Guardian",
    "logo": "/images/logos/tech/typescript-logo.webp",
    "link": "https://www.typescriptlang.org/",
    "title": "Typescript Title",
    "description": "With TypeScript, I enhance JavaScript code with strong typing, improving code reliability and maintainability. I utilize TypeScript to catch errors early and write robust, scalable applications."
  },
  {
    "id": "04",
    "name": "The State Commander",
    "logo": "/images/logos/tech/redux-logo.webp",
    "link": "https://redux.js.org/",
    "title": "Redux Title",
    "description": "Skilled in managing complex application state using Redux, I ensure predictable and centralized state management. This enables seamless data flow and easier debugging in large-scale React applications."
  },
  {
    "id": "05",
    "name": "The Server Sage",
    "logo": "/images/logos/tech/nextjs-logo.png",
    "link": "https://nextjs.org/",
    "title": "Next Title",
    "description": "Experienced with Next.js, I develop server-rendered React applications that optimize performance and SEO. I leverage Next.js features like static generation and server-side rendering to deliver high-quality web experiences."
  },
  {
    "id": "06",
    "name": "The Commit Captain",
    "logo": "/images/logos/tech/git-logo.png",
    "link": "https://git-scm.com/",
    "title": "Git Title",
    "description": "Proficient in Git, I manage version control efficiently, enabling smooth collaboration and code integration. I follow best practices in branching, committing, and merging to maintain a clean and organized codebase."
  },
  {
    "id": "07",
    "name": "The Bug Slayer",
    "logo": "/images/logos/tech/jest-logo.png",
    "link": "https://jestjs.io/",
    "title": "Jest Title",
    "description": "Utilizing Jest, I implement comprehensive testing strategies to ensure code quality and reliability. I write unit and integration tests to identify and eliminate bugs early in the development process."
  }
]
